In [79]:
people = {
    'first': ['Dinesh', 'Hardik', 'Bishnu'],
    'last': ['Paudel', 'Paudel', 'Dhakal'],
    'email': ['dnespaudel@gmail.com', 'hardikkhanl@gmail.com', 'bishnudhakal@gmail.com']
}

In [80]:
import pandas as pd

In [81]:
df = pd.DataFrame(people)

In [82]:
df

    first    last                   email
0  Dinesh  Paudel    dnespaudel@gmail.com
1  Hardik  Paudel   hardikkhanl@gmail.com
2  Bishnu  Dhakal  bishnudhakal@gmail.com

In [83]:
filt = (df['last'] == 'Dhakal') | (df['first'] == 'Dinesh')

In [84]:
df.loc[~filt]

    first    last                  email
1  Hardik  Paudel  hardikkhanl@gmail.com

In [85]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [86]:
df.columns = ['first_name', 'last_name', 'email']

In [87]:
df

  first_name last_name                   email
0     Dinesh    Paudel    dnespaudel@gmail.com
1     Hardik    Paudel   hardikkhanl@gmail.com
2     Bishnu    Dhakal  bishnudhakal@gmail.com

In [88]:
df.columns = [x.lower() for x in df.columns]

In [89]:
df.columns = df.columns.str.replace(' ', '_')

In [90]:
df

  first_name last_name                   email
0     Dinesh    Paudel    dnespaudel@gmail.com
1     Hardik    Paudel   hardikkhanl@gmail.com
2     Bishnu    Dhakal  bishnudhakal@gmail.com

In [91]:
df.rename(columns = {'first_name': 'first', 'last_name': 'last'}, inplace=True)

In [92]:
df

    first    last                   email
0  Dinesh  Paudel    dnespaudel@gmail.com
1  Hardik  Paudel   hardikkhanl@gmail.com
2  Bishnu  Dhakal  bishnudhakal@gmail.com

In [93]:
df.loc[2] = ['Navaraj', 'Pokharel', 'navarajpokharel@gmail.com']

In [94]:
df

     first      last                      email
0   Dinesh    Paudel       dnespaudel@gmail.com
1   Hardik    Paudel      hardikkhanl@gmail.com
2  Navaraj  Pokharel  navarajpokharel@gmail.com

In [95]:
df.at[1, ['last', 'email']] = ['Khanal', 'hardikkhanal10@gmail.com']

In [96]:
df

     first      last                      email
0   Dinesh    Paudel       dnespaudel@gmail.com
1   Hardik    Khanal   hardikkhanal10@gmail.com
2  Navaraj  Pokharel  navarajpokharel@gmail.com

In [97]:
filt = (df['email'] == 'navarajpokharel@gmail.com')

In [98]:
df[filt]['last']

2    Pokharel
Name: last, dtype: object

In [99]:
df.loc[filt, 'last'] = 'Kshetry'

In [100]:
df['email'] = df['email'].str.upper()

In [101]:
df

     first     last                      email
0   Dinesh   Paudel       DNESPAUDEL@GMAIL.COM
1   Hardik   Khanal   HARDIKKHANAL10@GMAIL.COM
2  Navaraj  Kshetry  NAVARAJPOKHAREL@GMAIL.COM

In [102]:
df['email'] = df['email'].str.lower()

In [103]:
df

     first     last                      email
0   Dinesh   Paudel       dnespaudel@gmail.com
1   Hardik   Khanal   hardikkhanal10@gmail.com
2  Navaraj  Kshetry  navarajpokharel@gmail.com

In [104]:
df['email'].apply(len)

0    20
1    24
2    25
Name: email, dtype: int64

In [105]:
def update_email(email):
    return email.upper()

In [106]:
df['email'] = df['email'].apply(update_email)

In [107]:
df

     first     last                      email
0   Dinesh   Paudel       DNESPAUDEL@GMAIL.COM
1   Hardik   Khanal   HARDIKKHANAL10@GMAIL.COM
2  Navaraj  Kshetry  NAVARAJPOKHAREL@GMAIL.COM

In [108]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [109]:
df

     first     last                      email
0   Dinesh   Paudel       dnespaudel@gmail.com
1   Hardik   Khanal   hardikkhanal10@gmail.com
2  Navaraj  Kshetry  navarajpokharel@gmail.com

In [110]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [111]:
len(df['first'])

3

In [112]:
df.apply(pd.Series.min)

first                  Dinesh
last                   Khanal
email    dnespaudel@gmail.com
dtype: object

In [113]:
df.apply(lambda x: x.min())

first                  Dinesh
last                   Khanal
email    dnespaudel@gmail.com
dtype: object

In [114]:
df.applymap(len)

   first  last  email
0      6     6     20
1      6     6     24
2      7     7     25

In [115]:
df.applymap(str.lower)

     first     last                      email
0   dinesh   paudel       dnespaudel@gmail.com
1   hardik   khanal   hardikkhanal10@gmail.com
2  navaraj  kshetry  navarajpokharel@gmail.com

In [116]:
df['first'] = df['first'].replace({'Dinesh': 'Manoj', 'Hardik':'Suraz'})

In [117]:
df

     first     last                      email
0    Manoj   Paudel       dnespaudel@gmail.com
1    Suraz   Khanal   hardikkhanal10@gmail.com
2  Navaraj  Kshetry  navarajpokharel@gmail.com

In [118]:
df['first'] + ' ' + df['last']

0       Manoj Paudel
1       Suraz Khanal
2    Navaraj Kshetry
dtype: object

In [119]:
df['full_name'] = df['first'] + ' ' + df['last']

In [120]:
df

     first     last                      email        full_name
0    Manoj   Paudel       dnespaudel@gmail.com     Manoj Paudel
1    Suraz   Khanal   hardikkhanal10@gmail.com     Suraz Khanal
2  Navaraj  Kshetry  navarajpokharel@gmail.com  Navaraj Kshetry

In [121]:
df.drop(columns=['first', 'last'], inplace=True)

In [122]:
df

                       email        full_name
0       dnespaudel@gmail.com     Manoj Paudel
1   hardikkhanal10@gmail.com     Suraz Khanal
2  navarajpokharel@gmail.com  Navaraj Kshetry

In [123]:
df['full_name'].str.split(' ', expand=True)

         0        1
0    Manoj   Paudel
1    Suraz   Khanal
2  Navaraj  Kshetry

In [124]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [125]:
df

                       email        full_name    first     last
0       dnespaudel@gmail.com     Manoj Paudel    Manoj   Paudel
1   hardikkhanal10@gmail.com     Suraz Khanal    Suraz   Khanal
2  navarajpokharel@gmail.com  Navaraj Kshetry  Navaraj  Kshetry

In [126]:
df

                       email        full_name    first     last
0       dnespaudel@gmail.com     Manoj Paudel    Manoj   Paudel
1   hardikkhanal10@gmail.com     Suraz Khanal    Suraz   Khanal
2  navarajpokharel@gmail.com  Navaraj Kshetry  Navaraj  Kshetry

In [127]:
people = {
    'first': ['Tony', 'Steve'],
    'last': ['Stark', 'Rogers'],
    'email': ['ironman@gmail.com', 'captainamerica@gmail.com']
}
df2 = pd.DataFrame(people)

In [128]:
df2

   first    last                     email
0   Tony   Stark         ironman@gmail.com
1  Steve  Rogers  captainamerica@gmail.com

In [129]:
df.append(df2, ignore_index=True, sort=False)

C:\Users\DELL\AppData\Local\Temp\ipykernel_3360\2503217469.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True, sort=False)

                       email        full_name    first     last
0       dnespaudel@gmail.com     Manoj Paudel    Manoj   Paudel
1   hardikkhanal10@gmail.com     Suraz Khanal    Suraz   Khanal
2  navarajpokharel@gmail.com  Navaraj Kshetry  Navaraj  Kshetry
3          ironman@gmail.com              NaN     Tony    Stark
4   captainamerica@gmail.com              NaN    Steve   Rogers

In [130]:
df = df.append(df2, ignore_index=True, sort=False)

C:\Users\DELL\AppData\Local\Temp\ipykernel_3360\3370980109.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True, sort=False)

In [131]:
df

                       email        full_name    first     last
0       dnespaudel@gmail.com     Manoj Paudel    Manoj   Paudel
1   hardikkhanal10@gmail.com     Suraz Khanal    Suraz   Khanal
2  navarajpokharel@gmail.com  Navaraj Kshetry  Navaraj  Kshetry
3          ironman@gmail.com              NaN     Tony    Stark
4   captainamerica@gmail.com              NaN    Steve   Rogers

In [132]:
df.drop(index=4, inplace=True)

In [133]:
df

                       email        full_name    first     last
0       dnespaudel@gmail.com     Manoj Paudel    Manoj   Paudel
1   hardikkhanal10@gmail.com     Suraz Khanal    Suraz   Khanal
2  navarajpokharel@gmail.com  Navaraj Kshetry  Navaraj  Kshetry
3          ironman@gmail.com              NaN     Tony    Stark

In [134]:
filt = (df['last'] == 'Paudel')
df.drop(index = df[filt].index)

                       email        full_name    first     last
1   hardikkhanal10@gmail.com     Suraz Khanal    Suraz   Khanal
2  navarajpokharel@gmail.com  Navaraj Kshetry  Navaraj  Kshetry
3          ironman@gmail.com              NaN     Tony    Stark

In [136]:
df.sort_values(by='last', ascending=False)

                       email        full_name    first     last
3          ironman@gmail.com              NaN     Tony    Stark
0       dnespaudel@gmail.com     Manoj Paudel    Manoj   Paudel
2  navarajpokharel@gmail.com  Navaraj Kshetry  Navaraj  Kshetry
1   hardikkhanal10@gmail.com     Suraz Khanal    Suraz   Khanal